# Сообщения
msg = {
    "start": u"Привет! \
Предлагаем решить несколько задач от Техносферы и поучаствовать в розыгрыше призов. \
Которые мы доставим до дверей общаги или дома в течение 24 часов с момента объявления результатов. \
Акция действует до 10:00 08 июня и время пошло!",
    # ------------------
    "q1": u"Ответьте, пожалуйста, на несколько коротких вопросов. \
Так мы сможем связаться с вами для вручения приза",
    # ------------------
    "phone": u"Отправьте, пожалуйста, ваш телефон",
    # ------------------
    "email": u"Напишите свой e-mail:",
    # ------------------
    "error1": u"Проверьте соответствие номера телефона формату 8***-***-**-**",
    # ------------------
    "error2": u"Если ввели неверно почту. \
Проверьте соответствие почты example@mail.ru",
    # ------------------
    "main": u"Предлагаем решить 4-ре задачи. Время на решение ограничено, \
    прием ответов закроется в 10:00 8 июня. Задачи можно решать в любой последовательности. \
    Но чем раньше вы решите все верно, тем больше шансов выиграть приз. \
    Розыгрыш призов будет идти в группе Техносферы",
    # ------------------
    "ok": u"Ваш ответ принят",
    # ------------------
    "end": u"Поздравляем, вы прошли все испытания. \
Ваши ответы приняты, розыгрыш призов среди верно ответивших будет \
проводиться в группе Техносферы, следите за новостями!"
}


# Кнопки
but = {
    "b1": u"Продолжить дальше",
    "b2": u"Приступить к вопросам",
    "b3": u"Приступить",
    "b4": u"Следующая задача"
}

