# Сообщения
msg = {
    "start": u"Привет! &#128522;\n\
Решите несколько задач от Техносферы и получите приз.\n\
В случае победы, мы доставим его до дверей общежития или дома в Москве в течение 24 часов с момента объявления результов.\n\
Подробные условия конкурса закреплены в группе Техносферы. Прием решений задач завершится 8 июня в 10:00.\n\
Начинаем?",
    # ------------------
    "q1": u"Прежде чем начать, ответьте, пожалуйста, на несколько коротких вопросов, \
чтобы мы могли связаться с вами в случае победы.",
    # ------------------
    "phone": u"Отправьте, ваш номер телефона в любом формате начиная с 8900-000-00-00",
    # ------------------
    "email": u"Спасибо.\n\
А ещё нам нужен ваш e-mail",
    # ------------------
    "error1": u"Проверьте соответствие номера телефона формату 8***-***-**-**",
    # ------------------
    "error2": u"Если ввели неверно почту. \
Проверьте соответствие почты example@mail.ru",
    # ------------------
    "main": u"Теперь можно приступить к самому интересному.\n\
Нужно верно решить 4 задачи, прием ответов прекратится 8 июня в 10:00.\n\
Начинаем?",
    # ------------------
    "main_2": u"Приступить к решению?",
    # ------------------
    "ok": u"Ваш ответ принят",
    # ------------------
    "end": u"Поздравляем, вы прошли все испытания. \
Ваши ответы приняты, розыгрыш призов среди верно ответивших будет \
проводиться в группе Техносферы, следите за новостями!",
    # ------------------
    "buf": u"Ваш ответ принят",
    # ------------------
    "feedback1": u"Поздравляем! &#127881;\n\
Мы рады вашим успехам!\n\
Ваши ответы приняты.\n\
Розыгрыш призов среди тех, кто всё верно решил будет проводиться в группе Техносферы 8 июня.\n\
Следите за новостями!\n\
\n\
А пока, оставьте нам обратную связь.\n\
На сколько сложными были задания, оцените по следующей шкале:",
    # ------------------
    "feedback2": u"Спасибо, за оценку сложности наших заданий.\n\
Что вы думаете по поводу таких конкурсов? Укажите цифру, где:\n\
3 - очень нужно такое проводить. Организовывайте каждую неделю\n\
2 - иногда интересно было бы поучаствовать. Максимум 1 раз в месяц\n\
1 - бессмысленный конкурс. Не делайте больше так",
    # ------------------
    "end": u"Ответы приняты.\n\
Мы проверяем правильность ваших решений.\n\
А чтобы время пролетело незаметно, \
рекомендуем посмотреть видеозаписи лекций sphere.mail.ru/materials/video"
}


# Кнопки
but = {
    "b1": u"Продолжить дальше",
    "b2": u"Приступить к вопросам",
    "b3": u"Да",
    "b4": u"Следующая задача"
}

task = {
    "1": u"Задача №1 из 4\nВ техносфере обучается 299 студентов. \
И каждый студент знает хотя бы один язык программирования. \
180 студентов знает С++, 85 - python, 73 - Java, C++ и Python - 27, C++ и Java - 11, \
Python и Java - 8. В Mail хотят позвать студентов, знающих все 3 языка. \
Сколько студентов пригласят на стажировку?",
    "2": u"Хорошо начали. Продолжаем!\n\
Задача №2 из 4\nЖивущий в параллельной вселенной младший разработчик Иванов \
написал идеальную программу для суперкомпьютера с произвольным числом узлов. \
При работе на одной машине её алгоритмы производят 1 миллиард операций в секунду, \
но добавление второго узла приносит прибавку в 81 миллиардов, \
N-го узла — прибавку в (2N - 1)^4 миллиардов. К сожалению, \
в параллельной вселенной не научились решать проблемы со скоростью \
синхронизации и обмена данными, поэтому в действительности для \
суперкомпьютера из N узлов производительность программы меньше расчётной в N^5 раз. \
Сколько миллиардов операций в секунду будет производить программа Иванова, \
если ему дадут в распоряжение суперкомпьютер с бесконечным числов узлов? \
(Ответ дать десятичной дробью.)",
    "3": u"Смотрите, уже половину задач решили!\n\
Задача №3 из 4\nСколько лет Техносфере?",
    "4": u"Последняя задача! Мы в вас верим!\nЗадача №4 из 4\n\
Ежик весит 1 кг. И пахнет как мокрый асфальт?"
}

